---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.CurveUnderconstrained
source: html/f1b3d8d6-8d52-bac2-bc0a-cfa6463a3ae0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.CurveUnderconstrained Property

Segment is underconstrained. It requires additional parameterized dimensions.

## Syntax (C#)
```csharp
public static FailureDefinitionId CurveUnderconstrained { get; }
```